
#include <iostream>
using namespace std;
//Дана сторона квадрата a. Найти его площадь S = a^2
int main()
{
	int a = 5;
	int s = a*a;
   cout << "S="<<s;
   
   return 0;
}
